УТ_для_edt/src/InformationRegisters/CRM_ОбъектыАРМ/CRM_ОбъектыАРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОбъектыАРМ</name>
  <resources>
    <name>КрайнийСрок</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаДляСортировки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>День</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Время</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеИнтереса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </resources>
  <resources>
    <name>Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТемаСледующейАктивности</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Соисполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НаименованиеАРМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИзмерениеАРМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.CRM_ЭтапКалендарногоПлана</types>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.CRM_Взаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>CatalogRef.CRM_Диалоги</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Телемаркетинг</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.удалитьCRM_Мероприятие</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
      <types>TaskRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ЗадачиПользователей/CRM_ЗадачиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЗадачиПользователей</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КрайнийСрок</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проверяющий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Поставлено</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Закрыта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВключатьВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧтоСделать</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.CRM_Взаимодействие</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ИсполнителиДинамическойАдресации/CRM_ИсполнителиДинамическойАдресации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ИсполнителиДинамическойАдресации</name>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 имя корректное</comment>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.CRM_СостоянияЛидов</types>
    </type>
  </resources>
  <resources>
    <name>СконвертированВОбъект</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанСКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанала</name>
    <type>
      <types>EnumRef.CRM_ВидыКаналовПоступленияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтказаПоИнтересам</types>
    </type>
  </attributes>
  <dimensions>
    <name>Лид</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>CatalogRef.CRM_Диалоги</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ЗапланированныеАктивности/CRM_ЗапланированныеАктивности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЗапланированныеАктивности</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАктивности</name>
    <type>
      <types>EnumRef.CRM_ТипыАктивности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланируемаяАктивность</name>
    <type>
      <types>DocumentRef.CRM_Взаимодействие</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_ВидыСобытий/CRM_ВидыСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыСобытий</name>
  <enumValues>
    <name>ТелефонныйЗвонок</name>
  </enumValues>
  <enumValues>
    <name>ЛичнаяВстреча</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПочтовоеПисьмо</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронноеПисьмо</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВидыТочекМаршрута/CRM_ВидыТочекМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыТочекМаршрута</name>
  <enumValues>
    <name>Старт</name>
  </enumValues>
  <enumValues>
    <name>Действие</name>
  </enumValues>
  <enumValues>
    <name>Условие</name>
  </enumValues>
  <enumValues>
    <name>ВыборВарианта</name>
  </enumValues>
  <enumValues>
    <name>ВложенныйБизнесПроцесс</name>
  </enumValues>
  <enumValues>
    <name>Разделение</name>
  </enumValues>
  <enumValues>
    <name>Слияние</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>Завершение</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВидыСообщенияМессенджера/CRM_ВидыСообщенияМессенджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыСообщенияМессенджера</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_СтатусыЭтаповКалендарногоПлана/CRM_СтатусыЭтаповКалендарногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыЭтаповКалендарногоПлана</name>
  <enumValues>
    <name>Запланирована</name>
    <comment>Используется при создании</comment>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Проверена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ТипыЭтапов/CRM_ТипыЭтапов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ТипыЭтапов</name>
  <enumValues>
    <name>Этап</name>
  </enumValues>
  <enumValues>
    <name>КонтрольнаяТочка</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/CommonModules/CRM_РаботаАРМСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// CRM работа АРМ Сервер
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Первоначальное заполнение АРМ
//
// Параметры:
//  Параметры	 - Структура - Дополнительные параметры.
//
Процедура ПервоначальноеЗаполнениеАРМ(Параметры) Экспорт
	Набор = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьНаборЗаписей();
	Набор.Записывать = Истина;
	Набор.Записать(Истина);
	
	// Мои дела
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТелефонныйЗвонок.Ссылка,
	|	ЛОЖЬ КАК НаКонтроле,
	|	ТелефонныйЗвонок.Тема КАК Тема,
	|	ТелефонныйЗвонок.Дата КАК ДатаПолучения,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК КрайнийСрок,
	|	ТелефонныйЗвонок.АбонентКонтакт КАК Контакт,
	|	ТелефонныйЗвонок.АбонентКакСвязаться КАК КонтактАдрес
	|ИЗ
	|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭлектронноеПисьмоВходящее.Ссылка,
	|	ЛОЖЬ,
	|	ЭлектронноеПисьмоВходящее.Тема,
	|	ЭлектронноеПисьмоВходящее.ДатаПолучения,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
	|	ЭлектронноеПисьмоВходящее.ОтправительКонтакт,
	|	ЭлектронноеПисьмоВходящее.ОтправительАдрес
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ссылка.Пустая() Тогда Продолжить КонецЕсли;
		Об = Выборка.ссылка.получитьОбъект();
		CRM_ЗаполнениеАРММоиДела(Об, Ложь);
		CRM_ЗаполнениеАРММоиПродажи(Об, Ложь)
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_Взаимодействие.Ссылка
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	НЕ CRM_Взаимодействие.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадачаИсполнителя.Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	НЕ ЗадачаИсполнителя.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Об = Выборка.Ссылка.ПолучитьОбъект();
		CRM_ЗаполнениеАРМПриЗаписи(Об, Ложь);
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_ЗадачиПользователей.Объект КАК Ссылка,
	|	ВЫБОР
	|		КОГДА CRM_ЗадачиПользователей.Объект.Ссылка ССЫЛКА Задача.ЗадачаИсполнителя
	|			ТОГДА ВЫБОР
	|					КОГДА CRM_ЗадачиПользователей.Объект.Выполнена
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
	|					ИНАЧЕ CRM_ЗадачиПользователей.Статус
	|				КОНЕЦ
	|		ИНАЧЕ CRM_ЗадачиПользователей.Статус
	|	КОНЕЦ КАК Статус,
	|	CRM_ЗадачиПользователей.Пользователь
	|ИЗ
	|	РегистрСведений.CRM_ЗадачиПользователей КАК CRM_ЗадачиПользователей
	|ГДЕ
	|	CRM_ЗадачиПользователей.Статус <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Статус = Справочники.CRM_СостоянияСобытий.Завершено Тогда
			Попытка
				Об = Выборка.Ссылка.ПолучитьОбъект();
				CRM_ЗаполнениеАРМПриЗаписи(Об, Ложь);
			Исключение
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла;
	
	// Мои продажи
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_Интерес.Ссылка
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	НЕ CRM_Интерес.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ссылка.Пустая() Тогда Продолжить КонецЕсли;
		Об = Выборка.ссылка.получитьОбъект();
		CRM_ЗаполнениеАРММоиПродажи(Об, Ложь)
	КонецЦикла;
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура CRM_ЗаполнениеАРММоиДела(Источник, Отказ) Экспорт
	
	Ссылка = Источник.ссылка;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_ОбъектыАРМ.Объект,
	|	CRM_ОбъектыАРМ.НаименованиеАРМ,
	|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
	|	CRM_ОбъектыАРМ.Пользователь
	|ИЗ
	|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
	|ГДЕ
	|	CRM_ОбъектыАРМ.Объект = &Объект
	|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ";
	Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ТекущееИзмерение = "";
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.Объект = Ссылка;
		Запись.НаименованиеАРМ = "МоиДела";
		Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
		Запись.Пользователь = Выборка.Пользователь;
		Запись.Прочитать();
		Если Запись.Объект <> Неопределено Тогда
			ТекущееИзмерение = Выборка.ИзмерениеАРМ;
			Если ТипЗнч(Ссылка) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				БизнесПроцесс = Источник.БизнесПроцесс;
				Если Источник.Выполнена Тогда
					СтатусЗадачи = Справочники.CRM_СостоянияСобытий.Завершено;
				ИначеЕсли ЗначениеЗаполнено(БизнесПроцесс) И БизнесПроцесс.Завершен И НЕ Источник.Выполнена Тогда
					СтатусЗадачи = Справочники.CRM_СостоянияСобытий.Отменено;
				ИначеЕсли ЗначениеЗаполнено(БизнесПроцесс) И БизнесПроцесс.Стартован И НЕ БизнесПроцесс.Завершен И НЕ Источник.ПринятаКИсполнению Тогда
					СтатусЗадачи = Справочники.CRM_СостоянияСобытий.Запланировано;
				ИначеЕсли ЗначениеЗаполнено(БизнесПроцесс) И БизнесПроцесс.Стартован И НЕ БизнесПроцесс.Завершен И Источник.ПринятаКИсполнению Тогда
					СтатусЗадачи = Справочники.CRM_СостоянияСобытий.ВРаботе;
				КонецЕсли;
				Если СтатусЗадачи <> Справочники.CRM_СостоянияСобытий.Завершено И СтатусЗадачи <> Справочники.CRM_СостоянияСобытий.Запланировано Тогда
					// Возврат;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
				Если Источник.СтатусВзаимодействия <> Справочники.CRM_СостоянияСобытий.Завершено И Источник.СтатусВзаимодействия <> Справочники.CRM_СостоянияСобытий.Отменено Тогда
					// Возврат;
				КонецЕсли;	
			Иначе	
				// +Рарус alexpr
				//Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее")
				//	ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок") ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
				//	Если Ссылка.CRM_СкрытьВАРМ Тогда 
				//		Запись.Удалить();
				//	КонецЕсли;
				//КонецЕсли;
				Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
					ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее")
					ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок")
					ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_СообщениеМессенджера")
					ИЛИ ТипЗнч(Ссылка) = Тип("СправочникСсылка.CRM_Диалоги")
					ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_РассылкаЭлектронныхПисем") Тогда
					Если Ссылка.CRM_СкрытьВАРМ Тогда 
						Запись.Удалить();
					КонецЕсли;
				КонецЕсли;	
				// -Рарус alexpr
				// Возврат;
			КонецЕсли;	
		КонецЕсли;
		Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.удалитьCRM_Мероприятие") Тогда
			Запись.Удалить();
		КонецЕсли;	
	КонецЦикла;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_Взаимодействие.Ссылка
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	CRM_Взаимодействие.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
		ВыборкаВзаимодействия = Запрос.Выполнить().Выбрать();
		Пока ВыборкаВзаимодействия.Следующий() Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CRM_ОбъектыАРМ.Объект,
			|	CRM_ОбъектыАРМ.НаименованиеАРМ,
			|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
			|	CRM_ОбъектыАРМ.Пользователь
			|ИЗ
			|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
			|ГДЕ
			|	CRM_ОбъектыАРМ.Объект = &Объект
			|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ";
			Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
			Запрос.УстановитьПараметр("Объект", ВыборкаВзаимодействия.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
				Запись.Объект = Ссылка;
				Запись.НаименованиеАРМ = "МоиДела";
				Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
				Запись.Пользователь = Выборка.Пользователь;
				Запись.Прочитать();
				Запись.Удалить();
				Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
				Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
			Иначе	
				Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
				Если ВыборкаВзаимодействия.Ссылка.Ответственный = ВыборкаВзаимодействия.Ссылка.Автор Тогда
					Запись.ИзмерениеАРМ = "Текущие";
				Иначе
					Запись.ИзмерениеАРМ = "Входящие";
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено Или Источник.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			
			Запись.ДатаДляСортировки = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
			Запись.Объект = ВыборкаВзаимодействия.Ссылка;
			Контакт = "";
			Если ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.Партнер) Тогда
				Контакт = ВыборкаВзаимодействия.Ссылка.Партнер.Наименование;
				Запись.Клиент = ВыборкаВзаимодействия.Ссылка.Партнер;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо) Тогда
				Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо.Наименование;
				Запись.Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент) Тогда
				Контакт = ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент.Наименование;
				Запись.Клиент = ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент;
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо) Тогда
				Запись.Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо;
			КонецЕсли;	
			Запись.КрайнийСрок = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
			тТема 			= ВыборкаВзаимодействия.Ссылка.Тема;
			ТекстОписания = Строка(ВыборкаВзаимодействия.Ссылка.СостояниеИнтереса);
			НаКонтроле = Ложь;
			ДатаПолучения = Дата('00010101');
			// Контакт = "";
			КонтактАдрес = "";
			Запись.Пользователь = ВыборкаВзаимодействия.Ссылка.Ответственный;
			Срок = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
			Запись.День = Формат(Срок, "ДЛФ=DD");
			Запись.Избранный = Источник.Избранный;
			Если ВыборкаВзаимодействия.Ссылка.ВидВзаимодействия.ВидСобытия = Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча Тогда
				Запись.ВидКартинки = 15;
			Иначе
				Запись.ВидКартинки = 9;
			КонецЕсли;
			
			Запись.Время = Формат(Срок, "ДФ=HH:mm") + " - " + Формат(ВыборкаВзаимодействия.Ссылка.ПлановаяДатаЗавершение, "ДФ='HH:mm'");
			
			Если ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда
				Запись.ИзмерениеАРМ = "Завершенные";
				Запись.ДатаДляСортировки =  ВыборкаВзаимодействия.Ссылка.ДатаЗавершенияВзаимодействия;
			КонецЕсли;
			Запись.НаименованиеАРМ = "МоиДела";
			
			Запись.Заголовок = Строка(тТема);
			
			ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) ИЛИ ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
			
			Запись.ТекстОснования = ТекстОписания;
			
			Запись.Записать(Истина);
			
		КонецЦикла;	
		Возврат;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		Если Ссылка.ПометкаУдаления ИЛИ Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Если ЗначениеЗаполнено(Источник.CRM_РольОтветственного) Тогда
			Пользователь = Источник.CRM_РольОтветственного;
		ИначеЕсли ЗначениеЗаполнено(Источник.Ответственный) Тогда
			Пользователь = Источник.Ответственный;
		Иначе
			Возврат;
		КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = Источник.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.Дата;
		тТема 			= Источник.Тема;
		НаКонтроле = Ложь;
		ДатаПолучения = Источник.Дата;
		Контакт = Источник.ОтправительКонтакт;
		Если ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Запись.Клиент = Контакт.Владелец;
			Контакт = Контакт.Владелец;
		КонецЕсли;	
		Запись.Контакт = Источник.ОтправительКонтакт;
		КонтактАдрес = Источник.ОтправительАдрес;
		ТекстОписания = "";	
		Запись.Пользователь = Пользователь;
		Запись.ИзмерениеАРМ = "Входящие";
		Срок = Источник.ДатаПолучения;
		Запись.День =  Формат(Срок, "ДЛФ=DD");
		Запись.ВидКартинки = 12;
		Если Источник.Важность = Перечисления.ВариантыВажностиВзаимодействия.Высокая Тогда
			Запись.Избранный = Истина;
		Иначе	
			Запись.Избранный = Ложь;
		КонецЕсли;	
		Запись.Время = Формат(Источник.ДатаПолучения, "ДФ='HH:mm'") + " - " + Формат(Источник.ДатаПолучения, "ДФ='HH:mm'");
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) ИЛИ ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
		
		Запись.ТекстОснования = ТекстОписания;
		
		Запись.Записать(Истина);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		
		Если Ссылка.ПометкаУдаления ИЛИ Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Если ЗначениеЗаполнено(Источник.Ответственный) Тогда
			Пользователь = Источник.Ответственный;
		ИначеЕсли ЗначениеЗаполнено(Источник.Автор) Тогда
			Пользователь = Источник.Автор;
		Иначе
			Возврат;
		КонецЕсли;
		Запись	= РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки	= Источник.Дата;
		Запись.Объект				= Ссылка;
		Запись.КрайнийСрок			= Источник.Дата;
		тТема						= Источник.Тема;
		НаКонтроле					= Ложь;
		ДатаПолучения				= Источник.Дата;
		Контакт						= Источник.CRM_ОтправительКонтакт;
		Если ТипЗнч(Контакт)		= Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Запись.Клиент			= Контакт.Владелец;
			Контакт					= Контакт.Владелец;
		КонецЕсли;	
		Запись.Контакт				= Источник.CRM_ОтправительКонтакт;
		КонтактАдрес 				= Источник.CRM_ОтправительАдрес;
		ТекстОписания				= "";	
		Запись.Пользователь			= Пользователь;
		Запись.ИзмерениеАРМ			= "Входящие";
		Срок						= Источник.ДатаОтправления;
		Запись.День					=  Формат(Срок, "ДЛФ=DD");
		Запись.ВидКартинки			= 12;
		Если Источник.Важность		= Перечисления.ВариантыВажностиВзаимодействия.Высокая Тогда
			Запись.Избранный		= Истина;
		Иначе	
			Запись.Избранный		= Ложь;
		КонецЕсли;	
		Запись.Время				= Формат(Источник.ДатаОтправления, "ДФ='HH:mm'") + " - " + Формат(Источник.ДатаОтправления, "ДФ='HH:mm'");
		Запись.НаименованиеАРМ		= "МоиДела";
		Запись.Заголовок			= Строка(тТема);
		ТекстОписания				= ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес), ?(ЗначениеЗаполнено(Контакт), " | ", "")
			+ " <" + КонтактАдрес + ">", "") + ?(ЗначениеЗаполнено(Контакт) ИЛИ ЗначениеЗаполнено(КонтактАдрес), " | ", "") + ТекстОписания;
		Запись.ТекстОснования		= ТекстОписания;
		Запись.Записать(Истина);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Если Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = Источник.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.Дата;
		тТема 			= Источник.Тема;
		НаКонтроле = Ложь;
		ТекстОписания = "";
		ДатаПолучения = Источник.Дата;
		Контакт = Источник.АбонентКонтакт;
		Если ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Запись.Клиент = Контакт.Владелец;
			Контакт = Контакт.Владелец;
			
		КонецЕсли;	
		Запись.Контакт = Источник.АбонентКонтакт;
		КонтактАдрес = Источник.АбонентКакСвязаться;
		Запись.Пользователь = Источник.Ответственный;
		Запись.ИзмерениеАРМ = "Входящие";
		Срок = Источник.Дата;
		Запись.День = Формат(Срок, "ДЛФ=DD");
		Запись.ВидКартинки = 13;
		Если Источник.Важность = Перечисления.ВариантыВажностиВзаимодействия.Высокая Тогда
			Запись.Избранный = Истина;
		Иначе	
			Запись.Избранный = Ложь;
		КонецЕсли;
		Запись.Время = Формат(Срок, "ДФ='HH:mm'") + " - " + Формат(Срок, "ДФ='HH:mm'");
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) ИЛИ ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
		
		Запись.ТекстОснования = ТекстОписания;
		
		Запись.Записать(Истина);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Взаимодействие") И Ссылка.ВидВзаимодействия.ВидСобытия = Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча Тогда	
		Если Ссылка.ПометкаУдаления Тогда Возврат КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ОбъектыАРМ.Объект,
		|	CRM_ОбъектыАРМ.НаименованиеАРМ,
		|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
		|	CRM_ОбъектыАРМ.Пользователь
		|ИЗ
		|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
		|ГДЕ
		|	CRM_ОбъектыАРМ.Объект = &Объект
		|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ";
		Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
		Запрос.УстановитьПараметр("Объект", Ссылка);
		// Запрос.УстановитьПараметр("Пользователь", Источник.Ответственный);
		Выборка = Запрос.Выполнить().Выбрать();

		// Если НЕ Источник.Входящий Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Пока Выборка.Следующий() Цикл
			Стр = Источник.СвоиЛица.Найти(Выборка.Пользователь, "Лицо");
			Если Стр  = Неопределено И Выборка.Пользователь<>Источник.Ответственный Тогда
				Запись.Объект = Ссылка;
				Запись.НаименованиеАРМ = "МоиДела";
				Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
				Запись.Пользователь = Выборка.Пользователь;
				Запись.Прочитать();
				Запись.Удалить();
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ОбъектыАРМ.Объект КАК Объект,
		|	CRM_ОбъектыАРМ.НаименованиеАРМ КАК НаименованиеАРМ,
		|	CRM_ОбъектыАРМ.ИзмерениеАРМ КАК ИзмерениеАРМ,
		|	CRM_ОбъектыАРМ.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
		|ГДЕ
		|	CRM_ОбъектыАРМ.Объект = &Объект
		|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ
		|	И CRM_ОбъектыАРМ.Пользователь = &Пользователь";
		Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
		Запрос.УстановитьПараметр("Объект", Ссылка);
		Запрос.УстановитьПараметр("Пользователь", Источник.Ответственный);
		Выборка = Запрос.Выполнить().Выбрать();

		// Если НЕ Источник.Входящий Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Если Выборка.Следующий() Тогда
			Запись.Объект = Ссылка;
			Запись.НаименованиеАРМ = "МоиДела";
			Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
			Запись.Пользователь = Выборка.Пользователь;
			Запись.Прочитать();
			Запись.Удалить();
		КонецЕсли;
		
		Запись.ДатаДляСортировки = Источник.ПлановаяДата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.ПлановаяДата;
		тТема 			= Источник.Тема;
		НаКонтроле = Ложь;
		ТекстОписания = Строка(Источник.СостояниеИнтереса);
		ДатаПолучения = Источник.Дата;
		Контакт = "";
		Если ЗначениеЗаполнено(Источник.Партнер) Тогда
			Контакт = Источник.Партнер.Наименование;
			Запись.Клиент = Источник.Партнер;
		ИначеЕсли ЗначениеЗаполнено(Источник.КонтактноеЛицо) Тогда
			Контакт = Источник.КонтактноеЛицо.Наименование;
			Запись.Контакт = Источник.КонтактноеЛицо;
		ИначеЕсли ЗначениеЗаполнено(Источник.ПотенциальныйКлиент) Тогда
			Контакт = Источник.ПотенциальныйКлиент.Наименование;
			Запись.Клиент = Источник.ПотенциальныйКлиент;
		КонецЕсли;
		Если ЗначениеЗаполнено(Источник.КонтактноеЛицо) Тогда
			Запись.Контакт = Источник.КонтактноеЛицо;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Запись.Контакт) Тогда
			Запись.Контакт = Источник.СписокУчастников;
		КонецЕсли;
		Запись.Пользователь = Источник.Ответственный;
		Если Источник.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено ИЛИ  Источник.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено Тогда
			Запись.ИзмерениеАРМ = "Завершенные";
		Иначе
			Попытка
				Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
			Исключение	
				Запись.ИзмерениеАРМ = "Текущие";
			КонецПопытки;
		КонецЕсли;
		Если Запись.ИзмерениеАРМ = "" Тогда
			Запись.ИзмерениеАРМ = "Текущие";
		КонецЕсли;	
		Срок = Источник.ПлановаяДата;
		Запись.День = Формат(Срок, "ДЛФ=DD");
		Запись.ВидКартинки = 15;
		Запись.Избранный = Ложь;
		Запись.Время = Формат(Срок, "ДФ='HH:mm'") + " - " + Формат(Срок, "ДФ='HH:mm'");
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) ИЛИ ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
			
		Запись.ТекстОснования = ТекстОписания;
		
		Запись.Записать(Истина);	
		Для Каждого СтрокаУчастники Из Источник.СвоиЛица Цикл
			Если СтрокаУчастники.Лицо <> Источник.Ответственный И ТипЗнч(СтрокаУчастники.Лицо) = Тип("СправочникСсылка.Пользователи") Тогда
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	CRM_ОбъектыАРМ.Объект,
				|	CRM_ОбъектыАРМ.НаименованиеАРМ,
				|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
				|	CRM_ОбъектыАРМ.Пользователь
				|ИЗ
				|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
				|ГДЕ
				|	CRM_ОбъектыАРМ.Объект = &Объект
				|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ
				|	И CRM_ОбъектыАРМ.Пользователь = &Пользователь";
				Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
				Запрос.УстановитьПараметр("Объект", Ссылка);
				Запрос.УстановитьПараметр("Пользователь", СтрокаУчастники.Лицо);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
					Запись.Объект = Ссылка;
					Запись.НаименованиеАРМ = "МоиДела";
					Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
					Запись.Пользователь = Выборка.Пользователь;
					Запись.Прочитать();
					Запись.Удалить();
					Запись.ДатаДляСортировки = Источник.ПлановаяДата;
					Запись.Объект = Ссылка;
					Запись.КрайнийСрок = Источник.ПлановаяДата;
					тТема 			= Источник.Тема;
					НаКонтроле = Ложь;
					ТекстОписания = "";
					ДатаПолучения = Источник.Дата;
					Запись.Контакт = Источник.СписокУчастников;
					Запись.Пользователь = СтрокаУчастники.Лицо;
					Если Источник.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено ИЛИ  Источник.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено Тогда
						Запись.ИзмерениеАРМ = "Завершенные";
					Иначе
						Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
					КонецЕсли;
					
					Срок = Источник.ПлановаяДата;
					Запись.День = Формат(Срок, "ДЛФ=DD");
					Запись.ВидКартинки = 3;
					Запись.Избранный = Ложь;
					Запись.Время = Формат(Срок, "ДФ='HH:mm'") + " - " + Формат(Срок, "ДФ='HH:mm'");
					Запись.НаименованиеАРМ = "МоиДела";
					
					Запись.Заголовок = Строка(тТема);
					
					
					Запись.ТекстОснования = Источник.Содержание;
					
					Запись.Записать(Истина);
				Иначе	
					Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
					
					Запись.ДатаДляСортировки = Источник.ПлановаяДата;;
					Запись.Объект = Ссылка;
					Запись.КрайнийСрок = Источник.ПлановаяДата;;
					тТема 			= Источник.Тема;
					НаКонтроле = Ложь;
					ТекстОписания = "";
					ДатаПолучения = Источник.Дата;
					Запись.Контакт = Источник.СписокУчастников;
					Запись.Пользователь = СтрокаУчастники.Лицо;
					Если Источник.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено ИЛИ  Источник.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено Тогда
						Запись.ИзмерениеАРМ = "Завершенные";
					Иначе
						Запись.ИзмерениеАРМ = "Входящие";
					КонецЕсли;
					
					Срок = Источник.ПлановаяДата;
					Запись.День = Формат(Срок, "ДЛФ=DD");
					Запись.ВидКартинки = 15;
					Запись.Избранный = Ложь;
					Запись.Время = Формат(Срок, "ДФ='HH:mm'") + " - " + Формат(Срок, "ДФ='HH:mm'");
					Запись.НаименованиеАРМ = "МоиДела";
					
					Запись.Заголовок = Строка(тТема);
					
					
					Запись.ТекстОснования = Источник.Содержание;
					
					Запись.Записать(Истина);
				КонецЕсли;
				
				
			КонецЕсли;	
		КонецЦикла;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Взаимодействие") И Ссылка.ВидВзаимодействия.ВидСобытия <> Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча Тогда
		Если Ссылка.ПометкаУдаления Тогда Возврат КонецЕсли;
		
		Если Источник.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено Или Источник.ПометкаУдаления Тогда
			
		Иначе
			Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
			Запись.ДатаДляСортировки = Источник.ПлановаяДата;
			Запись.Объект = Ссылка;
			Контакт = "";
			Если ЗначениеЗаполнено(Источник.Партнер) Тогда
				Контакт = Источник.Партнер.Наименование;
				Запись.Клиент = Источник.Партнер;
			ИначеЕсли ЗначениеЗаполнено(Источник.КонтактноеЛицо) Тогда
				Контакт = Источник.КонтактноеЛицо.Наименование;
				Запись.Контакт = Источник.КонтактноеЛицо;
			ИначеЕсли ЗначениеЗаполнено(Источник.ПотенциальныйКлиент) Тогда
				Контакт = Источник.ПотенциальныйКлиент.Наименование;
				Запись.Клиент = Источник.ПотенциальныйКлиент;
			КонецЕсли;
			Если ЗначениеЗаполнено(Источник.КонтактноеЛицо) Тогда
				Запись.Контакт = Источник.КонтактноеЛицо;
			КонецЕсли;	
			Запись.КрайнийСрок = Источник.ПлановаяДата;
			тТема 			= Источник.Тема;
			ТекстОписания = Строка(Источник.СостояниеИнтереса);
			НаКонтроле = Ложь;
			ДатаПолучения = Дата('00010101');
			// Контакт = "";
			КонтактАдрес = "";
			Запись.Пользователь = Источник.Ответственный;
			Срок = Источник.ПлановаяДата;
			Запись.День = Формат(Срок, "ДЛФ=DD");
			Если ТипЗнч(Источник.ДокументОснование) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				Если Источник.ДокументОснование.CRM_Личная Тогда
					Запись.ВидКартинки = 3;
				Иначе	
					Запись.ВидКартинки = 6;
				КонецЕсли;	
				Если Источник.ДокументОснование.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая Тогда
					Запись.Избранный = Истина;
				Иначе	
					Запись.Избранный = Ложь;
				КонецЕсли;
			Иначе
				Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
					Запись.Избранный = Источник.ДокументОснование.Избранный;
				КонецЕсли;
				Запись.ВидКартинки = 9;
			КонецЕсли;
			
			Запись.Время = Формат(Срок, "ДФ=HH:mm") + " - " + Формат(Источник.ПлановаяДатаЗавершение, "ДФ='HH:mm'");
			Если Источник.Ответственный = Источник.Автор Тогда
				Запись.ИзмерениеАРМ = "Текущие";
			Иначе
				Запись.ИзмерениеАРМ = "Входящие";
			КонецЕсли;	
			Если Источник.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда
				Запись.ИзмерениеАРМ = "Завершенные";
				Запись.ДатаДляСортировки =  Источник.ДатаЗавершенияВзаимодействия;
			КонецЕсли;	
			Запись.НаименованиеАРМ = "МоиДела";
			
			Запись.Заголовок = Строка(тТема);
			
			ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) ИЛИ ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
			
			Запись.ТекстОснования = ТекстОписания;
			
			Запись.Записать(Истина);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Если Ссылка.ПометкаУдаления ИЛИ Ссылка.CRM_ТочкаМаршрута.Вид = Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс Тогда
			Возврат;
		КонецЕсли;
		//Если ТипЗнч(Источник.БизнесПроцесс) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		//	Если ЗначениеЗаполнено(Источник.БизнесПроцесс.Интерес) И (ТипЗнч(Источник.БизнесПроцесс.Интерес) = Тип("ДокументСсылка.CRM_Интерес"))
		//		И ЗначениеЗаполнено(Источник.CRM_СостояниеИнтереса) И Источник.Исполнитель = Источник.БизнесПроцесс.Интерес.Ответственный Тогда
		//		Возврат;
		//	КонецЕсли;
		//КонецЕсли;
		
		Если ТипЗнч(Источник.БизнесПроцесс) = Тип("БизнесПроцессСсылка.Задание") Тогда
			Проверящющий = Источник.БизнесПроцесс.Проверяющий;
		Иначе
			Проверящющий = Неопределено;
		КонецЕсли;
		
		
		Если СтатусЗадачи = Справочники.CRM_СостоянияСобытий.Отменено Тогда
			Возврат;
		КонецЕсли;
		
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = Источник.СрокИсполнения;
		Если Источник.CRM_Личная И НЕ ЗначениеЗаполнено(Источник.СрокИсполнения) Тогда
			Запись.ДатаДляСортировки = Источник.Дата;
		КонецЕсли;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.СрокИсполнения;
		тТема 			= Источник.Наименование;
		НаКонтроле = (Проверящющий = Источник.Автор);
		ДатаПолучения = Дата('00010101');
		Контакт = "";
		Если ЗначениеЗаполнено(Источник.CRM_Партнер) Тогда
			Контакт = Источник.CRM_Партнер.Наименование;
			Запись.Клиент = Источник.CRM_Партнер;
			
		ИначеЕсли ЗначениеЗаполнено(Источник.CRM_КонтактноеЛицо) Тогда
			Контакт = Источник.CRM_КонтактноеЛицо.Наименование;
			Запись.Контакт = Источник.CRM_КонтактноеЛицо;
		КонецЕсли;
		Если ЗначениеЗаполнено(Источник.CRM_КонтактноеЛицо) Тогда
			Запись.Контакт = Источник.CRM_КонтактноеЛицо;
		КонецЕсли;
		КонтактАдрес = "";
		ТекстОписания = "";
		Если ЗначениеЗаполнено(Источник.Исполнитель) Тогда
			Запись.Пользователь = Источник.Исполнитель;
		ИначеЕсли ЗначениеЗаполнено(Источник.РольИсполнителя) Тогда
			Запись.Пользователь = Источник.РольИсполнителя;
		КонецЕсли;
		Срок = Источник.СрокИсполнения;
		Запись.День = Формат(Срок, "ДЛФ=DD");
		Если Источник.CRM_Личная Тогда
			Запись.ВидКартинки = 3;
			ТекстОписания = Источник.Описание;
		Иначе	
			ТекстОписания = Строка(Источник.CRM_ТочкаМаршрута);
			Запись.ВидКартинки = 6;
		КонецЕсли;
		Если Источник.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая Тогда
			Запись.Избранный = Истина;
		Иначе	
			Запись.Избранный = Ложь;
		КонецЕсли;
		Запись.Время = Формат(Источник.СрокИсполнения, "ДФ='HH:mm'") + " - " + Формат(Источник.СрокИсполнения, "ДФ='HH:mm'");
		Если Источник.Выполнена  Тогда
			Запись.ИзмерениеАРМ = "Завершенные";
			Запись.ДатаДляСортировки =  Источник.ДатаИсполнения;
		ИначеЕсли ТипЗнч(Источник) = Тип("ЗадачаОбъект.ЗадачаИсполнителя") 
			И (Источник.ДополнительныеСвойства.Свойство("ПринятаКИсполнениюПередЗаписью") 
			И НЕ Источник.ДополнительныеСвойства.ПринятаКИсполнениюПередЗаписью И Источник.ПринятаКИсполнению) 
			И НЕ Источник.CRM_Личная Тогда
			Запись.ИзмерениеАРМ = "Текущие";
		//ИначеЕсли Источник.ПринятаКИсполнению И НЕ Источник.CRM_Личная Тогда
		//	Запись.ИзмерениеАРМ = "Текущие";
		ИначеЕсли ЗначениеЗаполнено(ТекущееИзмерение) И ТекущееИзмерение <> "Завершенные" Тогда 
			Запись.ИзмерениеАРМ = ТекущееИзмерение;
		ИначеЕсли Источник.Исполнитель = Источник.Автор Тогда
			Запись.ИзмерениеАРМ = "Текущие";
		Иначе
			Запись.ИзмерениеАРМ = "Входящие";
		КонецЕсли;
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) ИЛИ ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
		
		Запись.ТекстОснования = ТекстОписания;
		
		Если Запись.Пользователь <> Справочники.РолиИсполнителей.CRM_ДинамическаяАдресация Тогда
			Запись.Записать(Истина);
		Иначе
			Если Источник.ДополнительныеСвойства.Свойство("ИсполнителиДинамическойАдресации") Тогда
				Исполнители = Источник.ДополнительныеСвойства.ИсполнителиДинамическойАдресации;
			Иначе
				Исполнители = РегистрыСведений.CRM_ИсполнителиДинамическойАдресации.ИсполнителиЗадачи(Ссылка);
			КонецЕсли;
			Для каждого Исполнитель Из Исполнители Цикл
				ЗаписьИсполнителя = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ЗаписьИсполнителя, Запись);
				ЗаписьИсполнителя.Пользователь = Исполнитель;
				ЗаписьИсполнителя.Записать(Истина);
			КонецЦикла;
		КонецЕсли;		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_Взаимодействие.Ссылка
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	CRM_Взаимодействие.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
		ВыборкаВзаимодействия = Запрос.Выполнить().Выбрать();
		// ЭтоПервыйПроход = Истина;
		Пока ВыборкаВзаимодействия.Следующий() Цикл
			Если ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено ИЛИ ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда
				Продолжить;
			КонецЕсли;	
		//	Если ЭтоПервыйПроход Тогда
		//		ЭтоПервыйПроход = Ложь;
		//		Запись.Удалить();
		//	КонецЕсли;	
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CRM_ОбъектыАРМ.Объект,
			|	CRM_ОбъектыАРМ.НаименованиеАРМ,
			|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
			|	CRM_ОбъектыАРМ.Пользователь
			|ИЗ
			|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
			|ГДЕ
			|	CRM_ОбъектыАРМ.Объект = &Объект
			|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ";
			Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
			Запрос.УстановитьПараметр("Объект", ВыборкаВзаимодействия.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
				Запись.Объект = ВыборкаВзаимодействия.Ссылка;
				Запись.НаименованиеАРМ = "МоиДела";
				Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
				Запись.Пользователь = Выборка.Пользователь;
				Запись.Прочитать();
				Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
			Иначе	
				Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
				Если ВыборкаВзаимодействия.Ссылка.Ответственный = ВыборкаВзаимодействия.Ссылка.Автор Тогда
					Запись.ИзмерениеАРМ = "Текущие";
				Иначе
					Запись.ИзмерениеАРМ = "Входящие";
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено Или Источник.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			
			Запись.ДатаДляСортировки = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
			Запись.Объект = ВыборкаВзаимодействия.Ссылка;
			Контакт = "";
			Если ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.Партнер) Тогда
				Контакт = ВыборкаВзаимодействия.Ссылка.Партнер.Наименование;
				Запись.Клиент = ВыборкаВзаимодействия.Ссылка.Партнер;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо) Тогда
				Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо.Наименование;
				Запись.Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент) Тогда
				Контакт = ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент.Наименование;
				Запись.Клиент = ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент;
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо) Тогда
				Запись.Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо;
			КонецЕсли;	
			Запись.КрайнийСрок = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
			тТема 			= ВыборкаВзаимодействия.Ссылка.Тема;
			ТекстОписания = Строка(ВыборкаВзаимодействия.Ссылка.СостояниеИнтереса);
			НаКонтроле = Ложь;
			ДатаПолучения = Дата('00010101');
			// Контакт = "";
			КонтактАдрес = "";
			Запись.Пользователь = ВыборкаВзаимодействия.Ссылка.Ответственный;
			Срок = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
			Запись.День = Формат(Срок, "ДЛФ=DD");
			Если Источник.CRM_Личная Тогда
				Запись.ВидКартинки = 3;
				ТекстОписания = Источник.Описание;
			Иначе	
				ТекстОписания = Строка(Источник.CRM_ТочкаМаршрута);
				Запись.ВидКартинки = 6;
			КонецЕсли;
			Если Источник.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая Тогда
				Запись.Избранный = Истина;
			Иначе	
				Запись.Избранный = Ложь;
			КонецЕсли;
			
			
			
			Запись.Время = Формат(Срок, "ДФ=HH:mm") + " - " + Формат(ВыборкаВзаимодействия.Ссылка.ПлановаяДатаЗавершение, "ДФ='HH:mm'");
			
			Если ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда
				Запись.ИзмерениеАРМ = "Завершенные";
				Запись.ДатаДляСортировки =  ВыборкаВзаимодействия.Ссылка.ДатаЗавершенияВзаимодействия;
			КонецЕсли;
			Запись.НаименованиеАРМ = "МоиДела";
			
			Запись.Заголовок = Строка(тТема);
			
			ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) ИЛИ ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
			
			Запись.ТекстОснования = ТекстОписания;
			
			Запись.Записать(Истина);
			
		КонецЦикла;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") И Источник.ВидСообщения = Перечисления.CRM_ВидыСообщенияМессенджера.Входящее Тогда
		Если Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = Источник.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.Дата;
		тТема 			= ?(ЗначениеЗаполнено(Источник.Тема), Источник.Тема, Источник.ТекстСообщения);
		НаКонтроле = Ложь;
		ДатаПолучения = Источник.Дата;
		Контакт = Источник.Контакт;
		Если ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Запись.Клиент = Контакт.Владелец;
			Контакт = Контакт.Владелец;
		КонецЕсли;	
		Запись.Контакт = Источник.Контакт;
		КонтактАдрес = Источник.КонтактПредставление;
		ТекстОписания = "";	
		Если ЗначениеЗаполнено(Источник.CRM_РольОтветственного) Тогда
			Запись.Пользователь = Источник.CRM_РольОтветственного;
		Иначе
			Запись.Пользователь = Источник.Ответственный;
		КонецЕсли;
		Запись.ИзмерениеАРМ = "Входящие";
		Срок = Источник.Дата;
		Запись.День =  Формат(Срок, "ДЛФ=DD");
		Запись.ВидКартинки = 14;
		Запись.Время = Формат(Источник.Дата, "ДФ='HH:mm'") + " - " + Формат(Источник.Дата, "ДФ='HH:mm'");
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) ИЛИ ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
		
		Запись.ТекстОснования = ТекстОписания;
		
		Запись.Записать(Истина);
		
	// +Рарус alexpr
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.CRM_Диалоги") Тогда
		
		Если Источник.CRM_СкрытьВАРМ Или Источник.Завершен Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеСостоянияЛида = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(Ссылка);
		Если ДанныеСостоянияЛида <> Неопределено Тогда
			Если ДанныеСостоянияЛида.Состояние = Справочники.CRM_СостоянияЛидов.Отклонен
				Или ДанныеСостоянияЛида.Состояние = Справочники.CRM_СостоянияЛидов.ПовторныйОбработанный Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ПоследнееСообщение = CRM_РаботаСМессенджерамиСервер.ПоследнееСообщениеДиалога(Ссылка);
		
		Если ПоследнееСообщение = Неопределено
			 Или ПоследнееСообщение.ВидСообщения = Перечисления.CRM_ВидыСообщенияМессенджера.Исходящее Тогда
			Возврат;
		КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = ПоследнееСообщение.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = ПоследнееСообщение.Дата;
		тТема = ПоследнееСообщение.ТекстСокр;
		НаКонтроле = Ложь;
		ДатаПолучения = ПоследнееСообщение.Дата;
		Контакт = Источник.Контакт;
		Если ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Запись.Клиент = Контакт.Владелец;
			Контакт = Контакт.Владелец;
		КонецЕсли;	
		Запись.Контакт = Источник.Контакт;
		КонтактАдрес = Источник.КонтактПредставление;
		ТекстОписания = "";	
		Если ЗначениеЗаполнено(Источник.CRM_РольОтветственного) Тогда
			Запись.Пользователь = Источник.CRM_РольОтветственного;
		Иначе
			Запись.Пользователь = Источник.Ответственный;
		КонецЕсли;
		Запись.ИзмерениеАРМ = "Входящие";
		Срок = ПоследнееСообщение.Дата;
		Запись.День =  Формат(Срок, "ДЛФ=DD");
		Запись.ВидКартинки = 14;
		Запись.Время = Формат(ПоследнееСообщение.Дата, "ДФ='HH:mm'") + " - " + Формат(ПоследнееСообщение.Дата, "ДФ='HH:mm'");
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") 
			+ ?(ЗначениеЗаполнено(КонтактАдрес), ?(ЗначениеЗаполнено(Контакт), " | ", "") + " <" + КонтактАдрес 
			+ ">", "") + ?(ЗначениеЗаполнено(Контакт) ИЛИ ЗначениеЗаполнено(КонтактАдрес), " | ", "") 
			+ ТекстОписания;
		
		Запись.ТекстОснования = ТекстОписания;
		
		Запись.Записать(Истина);
	// -Рарус alexpr
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_ЭтапКалендарногоПлана") Тогда
		Если Источник.ПометкаУдаления Тогда Возврат КонецЕсли;
		Если Источник.Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Отменена Тогда Возврат КонецЕсли;
		Для каждого Участник Из Источник.Участники Цикл
			Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
			Если Источник.Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Проверена Тогда
				Запись.ИзмерениеАРМ = "Завершенные";
				Запись.ДатаДляСортировки =  Источник.ФактическаяДатаОкончания;
			ИначеЕсли Источник.Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.ВРаботе Тогда
				Запись.ИзмерениеАРМ = "Текущие";
				Запись.ДатаДляСортировки = Источник.ФактическаяДатаНачала;
			ИначеЕсли Источник.Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Запланирована Тогда
				Запись.ИзмерениеАРМ = "Входящие";
				Запись.ДатаДляСортировки = Источник.ПлановаяДатаНачала;
			КонецЕсли;
			Запись.Объект = Ссылка;
			Запись.КрайнийСрок = Источник.ПлановаяДатаОкончания;
			тТема = Источник.Тема;
			НаКонтроле = Ложь;
			ДатаПолучения = Источник.Дата;
			ТекстОписания = "";	
			Запись.Пользователь = Участник.Пользователь;
			Срок = Источник.ПлановаяДатаОкончания;
			Запись.День =  Формат(Срок, "ДЛФ=DD");
			Если Источник.ТипЭтапа = Перечисления.CRM_ТипыЭтапов.Этап Тогда
				Запись.ВидКартинки = 2;
			Иначе
				Запись.ВидКартинки = 1;
			КонецЕсли;
			Запись.Время = Формат(Запись.ДатаДляСортировки, "ДФ='HH:mm'") + " - " + Формат(Запись.ДатаДляСортировки, "ДФ='HH:mm'");
			Запись.НаименованиеАРМ = "МоиДела";
			
			Запись.Заголовок = Строка(тТема);
			
			Запись.Записать(Истина);
		КонецЦикла;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Телемаркетинг") Тогда
		Если Источник.ПометкаУдаления Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		
		Если Источник.Завершен Тогда
			Запись.ИзмерениеАРМ = "Завершенные";
		ИначеЕсли ЗначениеЗаполнено(ТекущееИзмерение) И ТекущееИзмерение <> "Завершенные" Тогда 
			Запись.ИзмерениеАРМ = ТекущееИзмерение;	
		Иначе
			Запись.ИзмерениеАРМ = "Входящие";
		КонецЕсли;

		Запись.ДатаДляСортировки = Источник.ДатаНачала;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.ДатаОкончания;
		тТема = Источник.Тема;
		НаКонтроле = Ложь;
		ДатаПолучения = Источник.Дата;
		ТекстОписания = "";	
		Запись.Пользователь = Источник.Ответственный;
		Срок = Источник.ДатаОкончания;
		Запись.День =  Формат(Срок, "ДЛФ=DD");
		Запись.ВидКартинки = 3;
		Запись.Время = Формат(Запись.ДатаДляСортировки, "ДФ='HH:mm'") + " - " + Формат(Запись.ДатаДляСортировки, "ДФ='HH:mm'");
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		Запись.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура CRM_ЗаполнениеАРМПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка И Источник.ДополнительныеСвойства.Свойство("ОтключитьБизнесЛогику") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) <> Тип("ДокументОбъект.CRM_Заявка") Тогда
		Если НЕ (Константы.CRM_ОтображатьВАРМИсходящиеПисьмаИЗвонки.Получить() = Истина) Тогда
			Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЭлектронноеПисьмоИсходящее") И НЕ Источник.CRM_СкрытьВАРМ Тогда
				Возврат;
			ИначеЕсли (ТипЗнч(Источник) = Тип("ДокументОбъект.ТелефонныйЗвонок")) И НЕ Источник.Входящий И НЕ Источник.CRM_СкрытьВАРМ Тогда	
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
		CRM_ЗаполнениеАРММоиДела(Источник, Отказ);
	КонецЕсли;	
	// +Рарус alexpr
	//Если ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_Интерес") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ЭлектронноеПисьмоВходящее") 
	//	ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ТелефонныйЗвонок") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_СообщениеМессенджера") 
	//	ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_Заявка") Тогда
	//	CRM_ЗаполнениеАРММоиПродажи(Источник, Отказ);
	//КонецЕсли;
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_Интерес")
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.ЭлектронноеПисьмоВходящее") 
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.ТелефонныйЗвонок")
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_СообщениеМессенджера") 
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_Заявка" )
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.CRM_Диалоги") Тогда
		
		CRM_ЗаполнениеАРММоиПродажи(Источник, Отказ);
		
	КонецЕсли;
	// -Рарус alexpr
	
КонецПроцедуры

Процедура CRM_ЗаполнениеАРММоиПродажи(Источник, Отказ) Экспорт
	
	Ссылка = Источник.ссылка;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ОбъектыАРМ.Объект КАК Объект,
	               |	CRM_ОбъектыАРМ.НаименованиеАРМ КАК НаименованиеАРМ,
	               |	CRM_ОбъектыАРМ.ИзмерениеАРМ КАК ИзмерениеАРМ,
	               |	CRM_ОбъектыАРМ.Пользователь КАК Пользователь,
	               |	CRM_ОбъектыАРМ.СостояниеИнтереса КАК СостояниеИнтереса
	               |ИЗ
	               |	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
	               |ГДЕ
	               |	CRM_ОбъектыАРМ.Объект = &Объект
	               |	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ
	               |	И CRM_ОбъектыАРМ.ИзмерениеАРМ <> ""Потерян""
	               |	И CRM_ОбъектыАРМ.ИзмерениеАРМ <> ""Закрыт""
	               |	И CRM_ОбъектыАРМ.Объект ССЫЛКА Документ.CRM_Интерес";
	Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиПродажи");
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.Объект = Ссылка;
		Запись.НаименованиеАРМ = "МоиПродажи";
		Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
		Запись.СостояниеИнтереса = Выборка.СостояниеИнтереса;
		Запись.Пользователь = Выборка.Пользователь;
		Запись.Прочитать();
		Если Запись.Объект <> Неопределено Тогда
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		
		Если Источник.ПометкаУдаления Тогда
			Возврат;
		КонецЕсли;
		
		Если Источник.ТипОбращения <> Справочники.CRM_ТипыОбращений.Интерес Тогда
			Возврат;
		КонецЕсли;
		
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
		Если ЗначениеЗаполнено(Источник.Валюта) Тогда
			Если Источник.Валюта.Код = "643" Тогда
				// Рубль
				ВалютаПредставление = Символ("8381");
			ИначеЕсли Источник.Валюта.Код = "978" Тогда
				// Евро
				ВалютаПредставление = Символ("8364");
			ИначеЕсли Источник.Валюта.Код = "840" Тогда
				// Доллар
				ВалютаПредставление = Символ("36");
			Иначе
				ВалютаПредставление = Источник.Валюта.Наименование;
			КонецЕсли;
		Иначе
			ВалютаПредставление = "";
		КонецЕсли;
		СтруктураСледующегоДействия	= РегистрыСведений.CRM_ЗапланированныеАктивности.СледующаяЗапланированнаяАктивность(Источник.Ссылка);
		Если СтруктураСледующегоДействия <> Неопределено Тогда
			ДатаСледующегоДействия = СтруктураСледующегоДействия.ПланируемаяДата;
			ТемаСледующегоДействия = СтруктураСледующегоДействия.Тема;
		Иначе
			ДатаСледующегоДействия = Источник.Дата;
			ТемаСледующегоДействия = "";
		КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = ?(Источник.СостояниеИнтереса.Завершено, Источник.ДатаЗакрытия, ДатаСледующегоДействия);
		Запись.Объект = Ссылка;
		Запись.НаименованиеАРМ = "МоиПродажи";
		Запись.КрайнийСрок = ДатаСледующегоДействия;
		Запись.ТемаСледующейАктивности = ТемаСледующегоДействия;
		НаКонтроле = Ложь;
		ДатаПолучения = Дата('00010101');
		Запись.СостояниеИнтереса = Источник.СостояниеИнтереса;
		// Запись.ИзмерениеАРМ = ?(Источник.СостояниеИнтереса <> Справочники.CRM_СостоянияИнтересов.ИнтересЗакрыт,
		// ВыборкаВоронка.Этап.Наименование, "Закрыт");;
		Запись.Пользователь = Источник.Ответственный;
		Запись.День = Формат(ДатаСледующегоДействия, "ДЛФ=DD");
		Запись.Время = Формат(ДатаСледующегоДействия, "ДФ=HH:mm") + " - " + Формат(ДатаСледующегоДействия, "ДФ='HH:mm'");
		Запись.ТекстОснования = Источник.Тема;
		Запись.Заголовок = Источник.Тема;
		Запись.ВидКартинки = 9;
		Запись.Клиент = Источник.Партнер;
		Запись.Избранный = Источник.Избранный;
		КоличествоТегов = Источник.CRM_Теги.Количество();     
		Запись.ОписаниеИнтереса	= ?(ЗначениеЗаполнено(ДатаСледующегоДействия), Формат(ДатаСледующегоДействия, "ДФ=dd.MM.yyyy"), "");
		Если ЗначениеЗаполнено(Источник.ОжидаемаяВыручка) Тогда
			СуммавВалюте = РаботаСКурсамиВалют.ПересчитатьВВалюту(Источник.ОжидаемаяВыручка, ВалютаУправленческогоУчета, Источник.Валюта, Источник.Дата);		
		Иначе
			СуммавВалюте = 0;
		КонецЕсли; 
		Запись.ОписаниеИнтереса = Запись.ОписаниеИнтереса + ?(ЗначениеЗаполнено(СуммавВалюте), ", ", "") + ?(ЗначениеЗаполнено(СуммавВалюте), Строка(СуммавВалюте) + " " + ВалютаПредставление, "") + ?(КоличествоТегов > 0, ", ", "");
		//Запись.ОписаниеИнтереса = Запись.ОписаниеИнтереса + ?(ЗначениеЗаполнено(Источник.ОжидаемаяВыручка), ", ", "") + ?(ЗначениеЗаполнено(Источник.ОжидаемаяВыручка), Строка(Источник.ОжидаемаяВыручка) + " " + ВалютаПредставление, "") + ?(КоличествоТегов > 0, ", ", "");
		Для Каждого тТег Из Источник.CRM_Теги Цикл
			Запись.ОписаниеИнтереса 	= Запись.ОписаниеИнтереса + Строка(тТег.Тег) + " | ";
		КонецЦикла;
		Если КоличествоТегов > 0 Тогда
			Запись.ОписаниеИнтереса	= Лев(Запись.ОписаниеИнтереса, СтрДлина(Запись.ОписаниеИнтереса)-3);
		КонецЕсли;
		
		Запись.Записать(Истина);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
